In [1]:
import pandas as pd
import numpy as np

# Cria DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB','GOOG','MSFT','FB' ],
        'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah', 'Sam', 'Amy', 'Carl'],
        'Venda':[200,120,340,124,243,350,150,235,190]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
6    GOOG      Sam    150
7    MSFT      Amy    235
8      FB     Carl    190

In [4]:
group = df.groupby('Empresa')

In [5]:
group.sum()

         Venda
Empresa
FB         783
GOOG       470
MSFT       699

In [6]:
group.mean()

              Venda
Empresa
FB       261.000000
GOOG     156.666667
MSFT     233.000000

In [7]:
group.describe()

        Venda
        count        mean         std    min    25%    50%    75%    max
Empresa
FB        3.0  261.000000   81.504601  190.0  216.5  243.0  296.5  350.0
GOOG      3.0  156.666667   40.414519  120.0  135.0  150.0  175.0  200.0
MSFT      3.0  233.000000  108.013888  124.0  179.5  235.0  287.5  340.0

In [8]:
group.count()

         Nome  Venda
Empresa
FB          3      3
GOOG        3      3
MSFT        3      3

In [9]:
group = df.groupby('Nome')

In [10]:
group

In [11]:
group.sum()

         Venda
Nome
Amy        575
Carl       433
Charlie    120
Sam        350
Sarah      350
Vanessa    124

In [12]:
group.sum().loc['Carl']

Venda    433
Name: Carl, dtype: int64